package com.guobao.ifp.enums;

/**
 * 
 * 【接口ID】
 * 
 * @author gbifp
 * @date 2018年3月21日 下午2:19:04
 * @version V1.0
 */
public enum ENUM_INTERFACEID {
	CF001("CF001", "认证建权"),
	NB001("NB001", "投保单号申请"), 
	NB002("NB002", "新契约核保"),
	NB003("NB003", "新契约签单"),
	NB004("NB004", "新契约影像上传"),
	NB005("NB005", "新契约回执回销"),
	NB006("NB006", "新契约电子投保单生成"),
	NB007("NB007", "移动展业签约查询匹配保单"),
	NB0024("NB0024", "新契约签单"),
	NB010001("010001", "新契约核保"),
	NB010002("010002", "新契约签单"),
	NB010003("010003", "新契约保单重打"),
	NB010004("010004", "新契约撤单"),
	NB010009("010009", "新单对账"),
	NB010010("010010", "双录文件同步"),
	NB010011("010011", "保单状态查询"),
	NB020001("020001", "犹退试算"),
	NB020011("020011", "犹退申请"),
	NB020010("020010", "保全对账"),
	FHNB002("FHNB002","泛华新契约核保"),
	FHNB003("FHNB003","泛华收费签单"),
	FHNB004("FHNB004","泛华失败手工转人核"),
	FHNB005("FHNB005","泛华撤单"),
	FHNB006("FHNB006","泛华电子投保单生成"),
	FHNB007("FHNB007", "泛华投保单号状态查询"),
	JDNB008("JDNB008", "移动展业生成电子投保单回调接口"),
	POS003("POS003", "客户联系地址变更"),
	QRY001("QRY001", "客户五要素查询客户号"),
	QRY002("QRY002", "客户号查询客户信息"),
	QRY003("QRY003", "客户号查询客户名下保单列表"),
	QRY004("QRY004", "保单号查询保单信息"),
	QRY005("QRY005", "保单号查询保单下险种列表"),
	QRY006("QRY006", "查询保单下险种信息"),
	QRY007("QRY007", "查询保单下投保人信息"),
	QRY008("QRY008", "查询保单下被保人信息"),
	QRY009("QRY009", "查询保单下受益人信息"),
	QRY010("QRY010", "查询保单某险种下责任信息"),
	QRY011("QRY011", "查询保单某险种下账户信息"),
	QRY012("QRY012", "保单号/客户号查询保全记录"),
	QRY013("QRY013", "保全受理号查询保全信息"),
	QRY014("QRY014", "投保单状态查询"),
	QRY015("QRY015", "保单号查询理赔记录"),
	QRY016("QRY016", "赔案号查询理赔信息"),
	QRY017("QRY017", "保费到账日期查询保单缴费信息"),
	QRY018("QRY018", "客户风险保额查询"),
	QRY019("QRY019", "查询代理人名下客户列表"),
	QRY020("QRY020", "查询代理人名下待缴费保单列表"),
	QRY021("QRY021", "查询代理人名下契撤/退保的保单列表"),
	QRY022("QRY022", "查询代理人名下某保单理赔记录"),
	QRY023("QRY023", "查询代理人名下需续期的保单列表"),
	QRY024("QRY024", "查询代理人名下失效的保单列表"),
	QRY025("QRY025", "查询代理人名下成交的保单列表"),
	QRY026("QRY026", "查询代理人名下保单首期/续期转账信息"),
	QRY027("QRY027", "查询代理人名下保单照会信息"),
	QRY028("QRY028", "查询代理人名下保单回执提醒照会信息"),
	QRY029("QRY029", "查询代理人名下保单功能性体检照会信息"),
	QRY030("QRY030", "查询代理人名下短险到期保单"),
	QRY031("QRY031", "投保单号状态查询"),
	QRY032("QRY032", "查询保全项信息"),
	QRY033("QRY033", "查询保单合同影像"),
	QRY034("QRY034", "查询代理人统计信息"),
	QRY035("QRY035", "查询代理人佣金信息"),
	QRY036("QRY036", "客户号查询地址信息"),
	QRY037("QRY037", "证件号码+证件类型查询客户5要素"),
	QRY038("QRY038", "查询照会明细信息"),
	QRY042("QRY042", "投保人客户号查询团险保单信息"),
    QRY039("QRY039", "集体保单号查询保障方案"),
    QRY040("QRY040", "查询团险个人保单明细"),
    QRY041("QRY041", "个人查询团单下个人保单"),
	WX001("WX001","网销核保"),
	WX002("WX002","网销签单"),
    XQ030001("030001", "续期缴费查询"),
	XQ030002("030002", "续期缴费"),
	XQ030009("030009", "续期对账"),
	WX003("WX003","网销试算"),
	WX004("WX004","网销核保"),
	WX005("WX005","网销签单"),
	WX006("WX006","网销回访"),
	AM001("AM001","微信保全联系方式查询"),
	AM002("AM002","微信保全联系方式变更"),
	PC001("PC001","微信保全银行信息查询"),
	PC002("PC002","微信保全银行信息变更"),
	QRY01("QRY01","查询保全历史记录"),
	CL001("CL001","官微查询客户"),
	CL002("CL002","官微理赔报案"),
	HJYXNB("HJYXNB","网销新契约"),
	NULL("NULL", "无此接口号！接口号:"),
	ExceptionCode("ExceptionCode", "报文异常,接口号:"),
	
	FAIL("Fail", "交易失败")
	;
	
	private final String code;
	private final String desc;

	ENUM_INTERFACEID(String code, String desc) {
		this.code = code;
		this.desc = desc;
	}

	public String code() {
		return code;
	}

	public String desc() {
		return desc;
	}

	/**
	 * 根据key获得desc
	 * 
	 * @param key
	 * @return
	 */
	public static String getEnumDescByKey(String key) {
		for (ENUM_INTERFACEID enumItem : ENUM_INTERFACEID.values()) {
			if (key.equals(enumItem.code())) {
				return enumItem.desc();
			}
		}
		return "";
	}

}
